I had the same issue when trying to add additional subnets to a [NLB](https://www.terraform.io/docs/providers/aws/r/lb.html) that was associated with an [endpoint service](`https://www.terraform.io/docs/providers/aws/r/vpc_endpoint_service.html). The subnet change correctly showed in the output plan for the NLB and showed the update to the service endpoint (new NLB).

<details>
<summary>Output plan</summary>
```
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:
...

  # module.proxy.aws_lb.nlb must be replaced
-/+ resource "aws_lb" "nlb" {
      ~ arn                              = "arn:aws:elasticloadbalancing:us-east-1:xxx:loadbalancer/net/bi-proxy-res/55938f006b539f3d" -> (known after apply)
      ~ arn_suffix                       = "net/bi-proxy-res/55938f006b539f3d" -> (known after apply)
      ~ dns_name                         = "bi-proxy-res-xxx.elb.us-east-1.amazonaws.com" -> (known after apply)
        enable_cross_zone_load_balancing = true
        enable_deletion_protection       = false
      ~ id                               = "arn:aws:elasticloadbalancing:us-east-1:xxx:loadbalancer/net/bi-proxy-res/55938f006b539f3d" -> (known after apply)
        internal                         = true
      ~ ip_address_type                  = "ipv4" -> (known after apply)
        load_balancer_type               = "network"
        name                             = "bi-proxy-res"
      ~ security_groups                  = [] -> (known after apply)
      ~ subnets                          = [ # forces replacement
          + "subnet-041dbefd3ec5b3a7a",
          + "subnet-0c67e2d5dcd4d5487",
          + "subnet-0fcf989be1b877c80",
            "subnet-1721bd7b",
            "subnet-53869709",
            "subnet-b33ce08c",
        ]
        tags                             = {
            "application" = "infra-service-endpoints-bi"
            "cost_centre" = "bi"
            "environment" = "res"
            "repository"  = "terraform/services/proxies-from-bi"
        }
      ~ vpc_id                           = "vpc-xxx" -> (known after apply)
      ~ zone_id                          = "xxx" -> (known after apply)

      - access_logs {
          - enabled = false -> null
        }

      - subnet_mapping {
          - subnet_id = "subnet-1721bd7b" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-53869709" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-b33ce08c" -> null
        }
      + subnet_mapping {
          + allocation_id = (known after apply)
          + subnet_id     = (known after apply)
        }
    }

  # module.proxy.aws_lb_listener.proxies["redshift"] must be replaced
-/+ resource "aws_lb_listener" "proxies" {
      ~ arn               = "arn:aws:elasticloadbalancing:us-east-1:xxx:listener/net/bi-proxy-res/55938f006b539f3d/f0fcbf2ff2f764e5" -> (known after apply)
      ~ id                = "arn:aws:elasticloadbalancing:us-east-1:xxx:listener/net/bi-proxy-res/55938f006b539f3d/f0fcbf2ff2f764e5" -> (known after apply)
      ~ load_balancer_arn = "arn:aws:elasticloadbalancing:us-east-1:xxx:loadbalancer/net/bi-proxy-res/55938f006b539f3d" -> (known after apply) # forces replacement
        port              = 5439
        protocol          = "TCP"
      + ssl_policy        = (known after apply)

      ~ default_action {
          ~ order            = 1 -> (known after apply)
            target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:xxx:targetgroup/bi-proxy-res-redshift/65e682dc094780b6"
            type             = "forward"
        }
    }

  # module.proxy.aws_vpc_endpoint_service.api_proxies will be updated in-place
  ~ resource "aws_vpc_endpoint_service" "api_proxies" {
        acceptance_required        = false
        allowed_principals         = [
            "arn:aws:iam::xxx:root",
        ]
        availability_zones         = [
            "us-east-1a",
            "us-east-1c",
            "us-east-1e",
        ]
        base_endpoint_dns_names    = [
            "vpce-svc-xxx.us-east-1.vpce.amazonaws.com",
        ]
        id                         = "vpce-svc-xxx"
        manages_vpc_endpoints      = false
      ~ network_load_balancer_arns = [
          - "arn:aws:elasticloadbalancing:us-east-1:xxx:loadbalancer/net/bi-proxy-res/55938f006b539f3d",
        ] -> (known after apply)
        service_name               = "xxx"
        service_type               = "Interface"
        state                      = "Available"
        tags                       = {
            "Name"        = "bi-proxy-res"
            "application" = "infra-service-endpoints-bi"
            "cost_centre" = "bi"
            "environment" = "res"
            "repository"  = "terraform/services/proxies-from-bi"
        }
    }

```
</details>

However it failed to delete the NLB when applying which resulted in:

<details>
<summary>Apply output</summary>
```
module.proxy.aws_lb_listener.proxies["redshift"]: Destroying... [id=arn:aws:elasticloadbalancing:us-east-1:xxx:listener/net/bi-proxy-res/55938f006b539f3d/f0fcbf2ff2f764e5]
module.proxy.aws_autoscaling_group.proxies: Modifying... [id=bi-proxy-res20200224134419632600000001]
module.proxy.aws_lb_listener.proxies["redshift"]: Destruction complete after 1s
module.proxy.aws_lb.nlb: Destroying... [id=arn:aws:elasticloadbalancing:us-east-1:xxx:loadbalancer/net/bi-proxy-res/55938f006b539f3d]
module.proxy.aws_security_group_rule.tcp_to_proxy_asg["redshift"]: Destruction complete after 1s
module.proxy.aws_security_group_rule.tcp_to_proxy_asg["redshift"]: Creating...
module.proxy.aws_autoscaling_group.proxies: Modifications complete after 2s [id=bi-proxy-res20200224134419632600000001]
module.proxy.aws_security_group_rule.tcp_to_proxy_asg["redshift"]: Creation complete after 2s [id=sgrule-1433283772]

Error: Error deleting LB: ResourceInUse: Load balancer 'arn:aws:elasticloadbalancing:us-east-1:xxx:loadbalancer/net/bi-proxy-res/55938f006b539f3d' cannot be deleted because it is currently associated with another service
        status code: 400, request id: 297f684c-e201-4430-ad1b-182ec9edde13

```
</details>

Note that this issue is different to #8536 as it applies to the [service endpoint](https://www.terraform.io/docs/providers/aws/r/vpc_endpoint_service.html) and not the [endpoint](https://www.terraform.io/docs/providers/aws/r/vpc_endpoint.html) so the work around mention to use the explicit [subnet association](https://www.terraform.io/docs/providers/aws/r/vpc_endpoint_subnet_association.html) does not apply here. I had to work around it manually by:

1. Rejecting the active "endpoint connection" on the service endpoint (without doing this it would not allow me to disassociate the NLB from the service endpoint)
2. Disassociating the NLB from the service endpoint
3. Apply the terraform plan
4. Accept the "endpoint connection" that was rejected in step 1.
